ID Number	Name	Pay Rate	Hours Worked

001	        Mary	 $15.00	        40

002	        John	 $22.00	        25

003	        Bob	     $35.00	        4

004	        Mel	     $43.00	        62

005	        Jen	     $17.00	        33

006	        Sue	     $29.00	        45

007	        Ken	     $40.00	        36

008	        Dave	 $20.00	        17

009	        Beth	 $37.00	        37

010	        Ray	     $16.50	        80

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect(':memory:')
c = conn.cursor()
c.execute("""CREATE TABLE salaries (
            ID text,
            name text,
            pay_rate integer,
            hours_worked integer,
            salary integer
            )""")
conn.commit()

In [3]:
class Emp:
    def __init__(self, identification, name, pay_rate, hours_worked, salary):
        self.identification = identification
        self.name = name
        self.pay_rate = pay_rate
        self.hours_worked = hours_worked
        self.salary = salary

In [4]:
emp1 = Emp("001", "Mary", 15.00, 40, (40*15))
emp2 = Emp("002", "John", 22.00, 25, (25*22))
emp3 = Emp("003", "Bob", 4.00, 35, (4*35))
emp4 = Emp("004", "Mel", 43, 62, ((40*43)+((62-40)*(43*1.5))))
emp5 = Emp("005", "Jen", 17.00, 33, (33*17))
emp6 = Emp("006", "Sue", 29.00, 45, ((40*29)+((45-40)*(29*1.5))))
emp7 = Emp("007", "Ken", 40.00, 36, (36*40))
emp8 = Emp("008", "Dave", 20.00, 17, (17*20))
emp9 = Emp("009", "Beth", 37.00, 37, (37*37))
emp10 = Emp("010", "Ray", 16.50, 80, ((40*16.5)+((80-40)*(16.5*1.5))))

In [5]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp1.identification, emp1.name, emp1.pay_rate, emp1.hours_worked, emp1.salary))
conn.commit()

In [6]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp2.identification, emp2.name, emp2.pay_rate, emp2.hours_worked, emp2.salary))
conn.commit()

In [7]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp3.identification, emp3.name, emp3.pay_rate, emp3.hours_worked, emp3.salary))
conn.commit()

In [8]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp4.identification, emp4.name, emp4.pay_rate, emp4.hours_worked, emp4.salary))
conn.commit()

In [9]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp5.identification, emp5.name, emp5.pay_rate, emp5.hours_worked, emp5.salary))
conn.commit()

In [10]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp6.identification, emp6.name, emp6.pay_rate, emp6.hours_worked, emp6.salary))
conn.commit()

In [11]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp7.identification, emp7.name, emp7.pay_rate, emp7.hours_worked, emp7.salary))
conn.commit()

In [12]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp8.identification, emp8.name, emp8.pay_rate, emp8.hours_worked, emp8.salary))
conn.commit()

In [13]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp9.identification, emp9.name, emp9.pay_rate, emp9.hours_worked, emp9.salary))
conn.commit()

In [14]:
c.execute("INSERT INTO salaries VALUES (?,?,?,?,?)", (emp10.identification, emp10.name, emp10.pay_rate, emp10.hours_worked, emp10.salary))
conn.commit()

In [15]:
c.execute("SELECT * FROM salaries WHERE ID = ?", ('001',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('002',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('003',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('004',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('005',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('006',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('007',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('008',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('009',))
print(c.fetchall())
c.execute("SELECT * FROM salaries WHERE ID = ?", ('010',))
print(c.fetchall())

[('001', 'Mary', 15, 40, 600)]
[('002', 'John', 22, 25, 550)]
[('003', 'Bob', 4, 35, 140)]
[('004', 'Mel', 43, 62, 3139)]
[('005', 'Jen', 17, 33, 561)]
[('006', 'Sue', 29, 45, 1377.5)]
[('007', 'Ken', 40, 36, 1440)]
[('008', 'Dave', 20, 17, 340)]
[('009', 'Beth', 37, 37, 1369)]
[('010', 'Ray', 16.5, 80, 1650)]